contrib-demo/xacml/service-engine/src/java/xacmlse/SampleXACMLRequest.xml

<?xml version="1.0" encoding="UTF-8"?>

<!--
    Document   : SampleXACMLRequest.xml
    Created on : December 5, 2007, 12:33 PM
    Author     : Serge
    Description:
        Purpose of the document follows.
-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xac="http://xml.sun.com/gte/schema/XACMLRequest">
   <soapenv:Header/>
   <soapenv:Body>
      <xac:Request>
         <xac:Subject>
            <xac:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:subject:subject-id" DataType="urn:oasis:names:tc:xacml:1.0:data-type:rfc822Name">
               <xac:AttributeValue>seth@users.example.com</xac:AttributeValue>
            </xac:Attribute>
            <xac:Attribute AttributeId="group" DataType="http://www.w3.org/2001/XMLSchema#string" Issuer="admin@users.example.com">
               <xac:AttributeValue>developers</xac:AttributeValue>
            </xac:Attribute>
         </xac:Subject>
         <xac:Resource>
            <xac:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:resource:resource-id" DataType="http://www.w3.org/2001/XMLSchema#anyURI">
               <xac:AttributeValue>http://server.example.com/code/docs/developer-guide.html</xac:AttributeValue>
            </xac:Attribute>
         </xac:Resource>
         <xac:Action>
            <xac:Attribute AttributeId="urn:oasis:names:tc:xacml:1.0:action:action-id" DataType="http://www.w3.org/2001/XMLSchema#string">
               <xac:AttributeValue>read</xac:AttributeValue>
            </xac:Attribute>
         </xac:Action>
      </xac:Request>
   </soapenv:Body>
</soapenv:Envelope>
